// file: /model/TestProducts.js
import ArticleData from "./ArticleDB.js";
import mongooseDbConnect from "../config/dbConnect.js";

mongooseDbConnect();
var article = [
    {
        id: '01',
        name: 'ครูพีซ—พราวพิมล เกียรตินาวาปกรณ์',
        edu: 'Ph.D.Counseling Psychology จุฬาลงกรณ์มหาวิทยาลัย',
        work: 'Acceptance and Commitment Therapy (ACT)',
        exp: 'ความสัมพันธ์ การทำงาน/การเรียน การพัฒนาตัวเอง',
        img1: '/img/psychologist1.png',
        img2: '/img/psychologist1Cut.png',
        valueDate: '',
        valueTime: '',
        id: '01',
        title: 'วิธีจับโกหกของคนพูดอย่างทำอย่าง คำพูดแบบไหนส่อแววกลับกลอกมากที่สุด',
        author: 'ณัฐวุฒิ เผ่าทวี',
        date: '01.09.2020',
        content: 'คุณจะทราบได้อย่างไรครับว่าคนที่พูดอย่างแต่ทำอีกอย่าง เขาใช้คำพูดของเขาในการโกหกอย่างไรบ้าง?\n\
        มีงานวิจัยอยู่ชิ้นหนึ่งที่ดูวิธีการสื่อสารของคนสองคนในเกมโชว์ที่มีชื่อว่า Golden Balls ที่ต้องตกลงกันว่า จะร่วมมือกันไหมถ้าหลังจากคุยกันแล้วทั้งสองคนตกลงร่วมมือกันต่างคนก็จะแบ่งเงินกองกลางกลับบ้านไปกัน คนละครึ่ง แต่ถ้าคนหนึ่งตอบว่าจะร่วมมือแต่อีกคนหนึ่งหักหลัง คือบอกว่าจะร่วมมือแต่กลับไม่ร่วมมือจริงๆ คนที่หักหลังก็จะได้เงินกองกลางกลับบ้านไปทั้งหมด ส่วนคนที่โดนหักหลังก็จะไม่ได้อะไรเลย\
        แต่ถ้าต่างฝ่ายต่างหักหลังซึ่งกันและกัน ทั้งคู่ก็จะเสียเงินกองกลางด้วยกันทั้งคู่ และจะไม่มีใครได้รับเงิน กลับบ้านไปเลย\
        ในงานวิจัยชิ้นนี้ได้ศึกษารูปแบบการเจรจาของผู้เล่นเกมนับร้อยๆ คู่ โดยแบ่งจำพวกคำพูดของผู้เข้าแข่งขันเป็น\
        4 กลุ่ม คือ\
            1. Explicit-Unconditional (ชัดเจน-ไม่มีเงื่อนไข)\
        เช่น “I will split” (ฉันจะแบ่งเงินกับคุณ), “I will not steal” (ฉันจะไม่ขโมยเงินกองกลาง)\
            2. Explicit-Conditional (ชัดเจน-มีเงื่อนไข)\
        เช่น “I will split if you split” (ฉันจะแบ่งเงินถ้าคุณแบ่งเหมือนกัน), “We will split together” (เดี๋ยวเราทั้งสองจะแบ่งเงินกันนะ)\
            3. Implicit - Unconditional(ไม่ชัดเจน - ไม่มีเงื่อนไข)\
        เช่น “I want to split” (ฉันอยากจะแบ่ง), “It is not in my nature to steal” (ปกติฉันไม่ใช่คนที่ชอบขโมยอะไร), “If I stole from you, the audience will never forgive me!” (ถ้าฉันขโมยล่ะก็ คนดูต้องไม่อภัยฉันแน่ๆ เลย), “You can trust me” (คุณเชื่อฉันได้)\
            4. Implicit-Conditional (ไม่ชัดเจน-มีเงื่อนไข)\
        เช่น “I think we should split” (ฉันคิดว่าเราน่าจะแบ่งเงินกันนะ), “I am willing to split if you split” (ฉันจะยอมแบ่งถ้าคุณแบ่ง)\
        ลองทายดูสิครับว่าคำพูดแบบไหนที่จะตามมาด้วยการหักหลังมากที่สุด\
        ผมเชื่อว่าหลายคนน่าจะพอเดากันถูกนะครับ คำตอบก็คือข้อ 4 นั่นเอง คือคำพูดแบบไม่ชัดเจน และมีเงื่อนไข รองลงมาก็คือข้อ 3 คือ ไม่ชัดเจน ไม่มีเงื่อนไข ส่วนคนที่ใช้คำพูดแบบชัดเจน และไม่มีเงื่อนไข ในข้อ 1 มากที่สุด ส่วนใหญ่มักจะทำตามที่พูดจริงๆ\
        สรุปก็คือเวลาที่คนส่วนใหญ่โกหก คำพูดที่เราใช้มักจะเป็นคำพูดที่ไม่บ่งบอกถึงเจตนาที่ชัดเจนของเรา ส่วนใหญ่จะเป็นคำพูดที่มีความยืดหยุ่น กำกวม และไม่แน่นอน และอาจจะเป็นคำพูดที่ค่อนข้างมีเงื่อนไข เช่น “ฉันคิดว่าฉันจะทำถ้าคุณจะทำ” เป็นต้น\
        เพราะฉะนั้นโปรดลองสังเกตการใช้คำพูดของคนรอบข้างดูนะครับว่า คำที่เขาใช้มักจะอยู่ในประเภทไหนบ้าง ทั้งแบบชัดเจนหรือไม่ชัดเจน มีเงื่อนไขหรือไม่มีเงื่อนไข',
        img1: '/img/article8.png',
        img2: '/img/article8.png',

    },
];
//console.log(JSON.stringify(products));
ArticleData.insertMany(article)
    .then(function (docs) {
        console.log("Successfully insert to DB");
        docs.forEach((e) => console.log(JSON.stringify(e, null, "\t")));
        console.log("done!!"); process.kill(process.pid, "SIGINT");
    })
    .catch(function (err) {
        console.log(err);
    });